perf/arqsoft.yaml
config:
  environments:
    arqsoft9090:
      target: 'http://localhost:9090/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-arqsoft9090"
    arqsoft9091:
      target: 'http://localhost:9091/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-arqsoft9091"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Plain
      duration: 10
      arrivalRate: 0
    - name: Ramp
      duration: 30
      arrivalRate: 5
      rampTo: 30
    - name: Plain
      duration: 120
      arrivalRate: 5
    - name: Plain
      duration: 120
      arrivalRate: 10
    - name: Plain
      duration: 120
      arrivalRate: 15
    - name: Plain
      duration: 120
      arrivalRate: 20
    - name: Plain
      duration: 120
      arrivalRate: 1
    - name: Plain
      duration: 10
      arrivalRate: 0

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'