perf/heavyTestRamp.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: PlainZero1
      duration: 10
      arrivalRate: 0
    - name: Ramp
      duration : 30
      arrivalRate: 1
      rampTo: 2
    - name: Plain
      duration: 300
      arrivalRate: 2
    - name: PlainZero2
      duration: 10
      arrivalRate: 1

scenarios:
  - name: Heavy (/heavy)
    flow:
      - get:
          url: '/heavy'