perf/limitTestRamp.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: PlainZero1
      duration: 10
      arrivalRate: 0
    - name: Ramp
      duration: 60
      arrivalRate: 100
      rampTo: 500
    - name: Plain
      duration: 60
      arrivalRate: 500
    - name: Ramp
      duration: 60
      arrivalRate: 50
      rampTo: 200
    - name: Plain
      duration: 60
      arrivalRate: 200
    - name: Ramp
      duration: 60
      arrivalRate: 100
      rampTo: 500
    - name: Plain
      duration: 60
      arrivalRate: 500
    - name: PlainZero2
      duration: 10
      arrivalRate: 1

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'