perf/sleepTest.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: PlainZero
      duration: 10
      arrivalRate: 0
    - name: Ramp
      duration: 30
      arrivalRate: 5
      rampTo: 30
    - name: Plain5
      duration: 120
      arrivalRate: 5
    - name: Plain10
      duration: 120
      arrivalRate: 10
    - name: PlainZero
      duration: 10
      arrivalRate: 1

scenarios:
  - name: Root (/sleep)
    flow:
      - get:
          url: '/sleep/'